import sys
from jd_seckill.jd_spider_requests import JdSeckill


if __name__ == '__main__':
    a = """

    //                            _ooOoo_
    //                           o8888888o
    //                           88" . "88
    //                           (| -_- |)
    //                            O\ = /O
    //                        ____/`---'\____
    //                      .   ' \\| |// `.
    //                       / \\||| : |||// \
    //                     / _||||| -:- |||||- \
    //                       | | \\\ - /// | |
    //                     | \_| ''\---/'' | |
    //                      \ .-\__ `-` ___/-. /
    //                   ___`. .' /--.--\ `. . __
    //                ."" '< `.___\_<|>_/___.' >'"".
    //               | | : `- \`.;`\ _ /`;.`/ - ` : | |
    //                 \ \ `-. \_ __\ /__ _/ .-` / /
    //         ======`-.____`-.___\_____/___.-`____.-'======
    //                            `=---='
    //
    //         .............................................
    //                       佛祖要帮我抢茅台
                                           BUG谢晋锋
    //          佛曰:
    //                  我有一个写字间，写字间里程序员；
    //                  要程序员写程序，又拿程序换酒钱。
    //                  抢醒只在网上坐，酒醉还来网下眠；
    //                  茅台酒醒日复日，网上网下年复年。
    //                  台上台下电脑间，不愿鞠躬老板前；

                                               
功能列表：                                                                                
 1.预约商品
 2.秒杀抢购商品
 3.单线程秒杀
    """
    print(a)

    jd_seckill = JdSeckill()
    choice_function = input('请选择:')
    if choice_function == '1':
        jd_seckill.reserve()
    elif choice_function == '2':
        jd_seckill.seckill_by_proc_pool()
    elif choice_function == '3':
        jd_seckill.seckill()
    else:
        print('没有此功能')
        sys.exit(1)

